-- ========================================================================
--  Лабораторная работа №2
--  Структура списков и стандартные функции обработки списков
-- ========================================================================

--1. Дан список [1,3,5,7,2,4,6,8].
--Вывести его 4-й элемент, т.е. 7.
getElement = [1,3,5,7,2,4,6,8] !! 3

--2. Дан список [[1,2],[3,4,5]].
--Вывести элемент 4.
getElement2 = [[1,2],[3,4,5]] !! 1 !! 1

--3. Дан список [(1,'a'),(2,'b'),(3,'c'),(4,'d')].
--Вывести элемент ‘с’.
getElement3 = do
	let (_,needChar) = [(1,'a'),(2,'b'),(3,'c'),(4,'d')] !! 2
	needChar

--4. Дан список [(1,'a'),(2,'b')]).
--Сформировать новый список [‘a’,’b’].
getElement4 = do
	let (_,needChars) = unzip [(1,'a'),(2,'b')]
	needChars